app/Controllers/BiodataController.php

SELECT *
FROM `biodata`
WHERE `biodata`.`id` = '21'
DELETE FROM `biodata`
WHERE `id` IN ('21')
---
    public function hapus($id)
    {
        $model = new MBiodata();
        $biodata = $model->find($id);

        if ($biodata) {
            $model->delete($id);