app/Controllers/BiodataController.php

INSERT INTO `biodata` (`nama`, `alamat`, `tempat_lahir`, `tanggal_lahir`, `jenis_kelamin`, `no_telp`, `email`) VALUES ('kjchdf', 'djhdf', 'kjdjd', '2025-10-20', 'Laki-laki', '83746', 'sd@gmail.com')
SELECT *
FROM `biodata`
WHERE `biodata`.`id` = 12
---
    public function create()
    {
        $jenisKelamin = $this->request->getVar('jenis_kelamin');
        $tanggalLahir = $this->request->getVar('tanggal_lahir');

        $allowedGender = ['Laki-laki', 'Perempuan'];
        if (!in_array($jenisKelamin, $allowedGender)) {
            return $this->failValidationErrors('Jenis kelamin harus Laki-laki atau Perempuan');
        }

        $formattedDate = $tanggalLahir ? date('Y-m-d', strtotime($tanggalLahir)) : null;

        $data = [
            'nama'           => $this->request->getVar('nama'),
            'alamat'         => $this->request->getVar('alamat'),
            'tempat_lahir'   => $this->request->getVar('tempat_lahir'),
            'tanggal_lahir'  => $formattedDate,
            'jenis_kelamin'  => $jenisKelamin,
            'no_telp'        => $this->request->getVar('no_telp'),
            'email'          => $this->request->getVar('email'),
        ];

        $model = new MBiodata();
        $model->insert($data);
        $biodata = $model->find($model->getInsertID());

SELECT *
FROM `biodata`
---
    public function list()
    {
        $model = new MBiodata();
        return $this->respond($model->findAll());

SELECT *
FROM `biodata`
WHERE `biodata`.`id` = '12'
DELETE FROM `biodata`
WHERE `id` IN ('12')
---
    public function hapus($id)
    {
        $model = new MBiodata();
        $biodata = $model->find($id);

        if ($biodata) {
            $model->delete($id);